firstapp/app/controllers/clients_controller.rb

INSERT INTO `clients` (`created_at`, `email`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2014-05-16 16:41:37', 'amira@yahoo.com', '$2a$10$5kZ7PLM81QoKxOOQnThnfuf1MrWDstMW8nEYSczqKNJ3WulPlsJii', '$2a$10$5kZ7PLM81QoKxOOQnThnfu', '2014-05-16 16:41:37')
---
  def create

    @client = Client.new(params[:client])

    if @client.save