firstapp/app/controllers/hotels_controller.rb

  def index

    # to select * from DB
    @hotels = Hotel.all
---
SELECT `hotels`.* FROM `hotels`

  def show

    @hotel = Hotel.find(params[:id])
---
SELECT `hotels`.* FROM `hotels` WHERE `hotels`.`id` = 0 LIMIT 1