firstapp/app/controllers/reviews_controller.rb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`myreview_id` IS NULL
---
  def index

    @@hotel_id=params[:hotel_id]

    @reviews = Review.where(:myreview_id=>params[:hotel_id])

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
INSERT INTO `reviews` (`created_at`, `myreview`, `myreview_date`, `myreview_id`, `myreview_user`, `updated_at`) VALUES ('2014-05-17 01:13:14', 'very good', '2014-11-11', NULL, 'amira', '2014-05-17 01:13:14')
---
   def create

     #to get from session
    @current_client ||= Client.find(session[:client_id]) if session[:client_id]

    @review = Review.new(params[:review])
    # from url
    @review.myreview_id = @@hotel_id
    #to get from session
    @review.myreview_user = @current_client.email

    #@review.save
    if @review.save