firstapp/app/controllers/rooms_controller.rb

  def index
  # GET /users/1
  # GET /users/1.json

  #from url

    @@hotel_id=params[:hotel_id]

    @info_rooms=Room.where(:hotel_id_id => params[:hotel_id])
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`hotel_id_id` IS NULL

  def reserve

       #to get from session
    @current_client ||= Client.find(session[:client_id]) if session[:client_id]


    @record = DateRoom.new()
      #to get from session
    @record.reserve_user = @current_client.email

    @record.room_id_id= @@room_id
    @record.busy_start= @@busy_start_post
    @record.busy_end= @@busy_end_post


    if @record.save
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
INSERT INTO `date_rooms` (`busy_end`, `busy_start`, `created_at`, `reserve_user`, `room_id_id`, `updated_at`) VALUES ('2014-12-11', '2014-11-11', '2014-05-20 01:51:53', 'amira@yahoo.com', 3, '2014-05-20 01:51:53')